import matplotlib.pyplot as plt
import matplotlib
# 预设字体格式，并传给rc方法
font = {'family': 'SimHei', "size":16}
matplotlib.rc('font', **font)  # 一次定义终身使用
# 四组数据

F_0_v = [0.7777777777777799, 0.9983333333333385, 1.1428571428571521, 1.230769230769244, 1.194029850746282, 1.2352941176470797, 1.2173913043478497]
F_1_v = [1.333333333333335, 1.7673076923076962, 2.1818181818181897, 2.3448275862069075, 2.5000000000000133, 2.7540983606557563, 2.6666666666666883]
F_2_v = [1.614457831325302, 2.313684210526319, 2.7378640776699075, 3.009174311926616, 3.274336283185853, 3.3846153846153997, 3.64705882352943]
f_j_vop_v = [    [0.22009561442976622, 0.16028684328929654, 0.016010441635508688],
    [0.2681293355864811, 0.19054185291328407, 0.07385461582477859],
    [0.2946202534141227, 0.2604841368657347, 0.0713930481422036],
    [0.31535107372549454, 0.2723131681260713, 0.09817992943614806],
    [0.27954404629768137, 0.29758736277362763, 0.14902339592670932],
    [0.281479071907929, 0.36854521958104547, 0.11652025364077456],
    [0.26599456868886806, 0.305230082878174, 0.21711808292851176]
]
f_j_vop_0=[row[0] for row in f_j_vop_v]
f_j_vop_1=[row[1] for row in f_j_vop_v]
f_j_vop_2=[row[2] for row in f_j_vop_v]

# 绘制折线图
plt.plot(range(len(F_0_v)), F_0_v, label='云服务器对用户的最优购买量', marker='.')
plt.plot(range(len(F_1_v)), F_1_v, label='M1云服务器对用户的最优购买量', marker='o')
plt.plot(range(len(F_2_v)), F_2_v, label='M2服务器对用户的最优购买量', marker='s')
plt.plot(range(len(f_j_vop_0)), f_j_vop_0, label='VOP对云服务器的最优购买量', marker='^')
plt.plot(range(len(f_j_vop_1)), f_j_vop_1, label='VOP对M1云服务器最优购买量', marker='^')
plt.plot(range(len(f_j_vop_2)), f_j_vop_2, label='VOP对M2服务器的最优购买量', marker='^')
# 添加图例
plt.legend()

# 添加标题和轴标签
plt.xlabel('用户数量', fontsize=16)
plt.ylabel('购买的计算资源量', fontsize=16)
plt.xticks(fontsize=13.5)  # 修改x轴刻度字体大小
plt.yticks(fontsize=13.5)  # 修改y轴刻度字体大小
# 添加图例并设置字体大小
plt.legend(fontsize='16')
# 显示图形

plt.show()
