import matplotlib.pyplot as plt
import matplotlib
# 预设字体格式，并传给rc方法
font = {'family': 'SimHei', "size":16}
matplotlib.rc('font', **font)  # 一次定义终身使用
# 四组数据




P_0_v=[5.399999999999995,5.999999999999993,6.299999999999992,6.499999999999991,6.69999999999999,6.79999999999999,6.89999999999999]
P_1_v=[4.499999999999998,5.199999999999996,5.499999999999995,5.799999999999994,5.999999999999993,6.0999999999999925,6.299999999999992]
P_2_v=[4.1499999999999995,4.749999999999997,5.149999999999996,5.449999999999995,5.649999999999994,5.849999999999993,5.949999999999993]
p_j_vop_v=[[3.346092980088082, 2.346092980088077, 2.046012658802936],[4.381223986481144, 3.1535316787888243, 2.8669818812179724],[5.089421336658177, 3.84266808990491, 3.4130829177954616],[5.492508942262496, 4.145028836161672, 3.7260728095877997],[5.486914826691605, 4.404825274452771, 4.0004004956917045],[5.722890274434905, 4.771106282149422, 4.183161767647521],[5.70838041395389, 4.722873167577029, 4.390324147969176]]

p_j_vop_0=[row[0] for row in p_j_vop_v]
p_j_vop_1=[row[1] for row in p_j_vop_v]
p_j_vop_2=[row[2] for row in p_j_vop_v]

X_range = [10, 20, 30, 40, 50, 60, 70]

# 绘制折线图
plt.plot(X_range, P_0_v, label='P_0_v', marker='.')
plt.plot(X_range, P_1_v, label='P_1_v', marker='o')
plt.plot(X_range, P_2_v, label='P_2_v', marker='s')
plt.plot(X_range, p_j_vop_0, label='p_j_vop_0', marker='^')
plt.plot(X_range, p_j_vop_1, label='p_j_vop_1', marker='^')
plt.plot(X_range, p_j_vop_2, label='p_j_vop_2', marker='^')
# 添加图例
plt.legend()

# 添加标题和轴标签
plt.xlabel('用户数量', fontsize=16)
plt.ylabel('价格', fontsize=16)
plt.xticks(fontsize=13.5)  # 修改x轴刻度字体大小
plt.yticks(fontsize=13.5)  # 修改y轴刻度字体大小
# 添加图例并设置字体大小
plt.legend(fontsize='16')
# 显示图形

plt.show()
