import matplotlib.pyplot as plt
import matplotlib
# 预设字体格式，并传给rc方法
font = {'family': 'SimHei', "size":16}
matplotlib.rc('font', **font)  # 一次定义终身使用
# 四组数据

F_0_v = [0.8387096774193605,0.918032786885252,0.918032786885252,0.918032786885252,0.9994444444444496,0.9994444444444496,0.9994444444444496,0.9983333333333385,0.9972222222222275]
F_1_v = [1.6603773584905706,1.6603773584905706,1.7692307692307732,1.7692307692307732,1.7685897435897475,1.7685897435897475,1.7685897435897475,1.7673076923076962,1.879084967320265]
F_2_v = [2.185567010309281,2.185567010309281,2.185567010309281,2.185567010309281,2.184879725085913,2.184879725085913,2.184879725085913,2.313684210526319,2.312280701754389]
f_j_vop_v = [[0.09103432301754244, 0.0, 0.0],[0.16385157267178674, 0.0, 0.0],[0.18147001143623964, 0.05197623859622702, 0.0],[0.1957324495465167, 0.09476355292705874, 0.0],[0.24588730806448467, 0.12279012932165356, 0.0],
[0.2579860183835526, 0.15908626027885742, 0.0],[0.2686017394673321, 0.19093342353019582, 0.009062599629397372],[0.27023890758409785, 0.1968705689061343, 0.08374323456360688],[0.27078185389215503, 0.2560547120032566, 0.08819070766332615]]


f_j_vop_0=[row[0] for row in f_j_vop_v]
f_j_vop_1=[row[1] for row in f_j_vop_v]
f_j_vop_2=[row[2] for row in f_j_vop_v]

# 绘制折线图
plt.plot(range(0,9), F_0_v, label='云服务器对用户的最优购买量', marker='.')
plt.plot(range(0,9), F_1_v, label='M1云服务器对用户的最优购买量', marker='o')
plt.plot(range(0,9), F_2_v, label='M2服务器对用户的最优购买量', marker='s')
plt.plot(range(0,9), f_j_vop_0, label='VOP对云服务器的最优购买量', marker='^')
plt.plot(range(0,9), f_j_vop_1, label='VOP对M1云服务器最优购买量', marker='^')
plt.plot(range(0,9), f_j_vop_2, label='VOP对M2服务器的最优购买量', marker='^')
# 添加图例
plt.legend()

# 添加标题和轴标签
plt.xlabel('车辆数量', fontsize=16)
plt.ylabel('购买的计算资源量', fontsize=16)
plt.xticks(fontsize=13.5)  # 修改x轴刻度字体大小
plt.yticks(fontsize=13.5)  # 修改y轴刻度字体大小
# 添加图例并设置字体大小
plt.legend(fontsize='16')
# 显示图形

plt.show()
