import matplotlib.pyplot as plt
import matplotlib

# 预设字体格式，并传给rc方法
font = {'family': 'SimHei', "size": 16}
matplotlib.rc('font', **font)  # 一次定义终身使用
# 四组数据

U_C_t=[2.695205136201472,2.69317302676955,2.711425108320504,2.7275645885849364,2.681658556653438,2.699947208896038,2.716717535186471,2.7199122015167303,2.7213341779325484]
U_M1=[5.545033819864722,5.545033819864722,5.541598619259009,5.548033385401227,5.553257478317735,5.56348850066842,5.5746356346798684,5.5751892339191755,5.554211544267335]
U_M2=[7.10579657774471,7.10579657774471,7.10579657774471,7.10579657774471,7.104523097270933,7.104523097270933,7.10457566092664,7.105745272004427,7.1040039495983915]
U_Vop=[-1.8363034311854343,-0.6677786095465466,-0.08824814815172322,-0.07314676232139689,0.2671830576444444,0.8815249201970657,1.1027403812689562,1.2349364214719472,1.6418614011841859]


# 绘制折线图
# X_range = [10, 20, 30, 40, 50, 60, 70]

plt.plot(range(0,9), U_C_t, marker='o', color="black",label='U_C_t')
plt.plot(range(0,9), U_M1, marker='o', color="red",label='U_M1')
plt.plot(range(0,9), U_M2, marker='s', color="blue",label='U_M2')
plt.plot(range(0,9), U_Vop, marker='^', color="green",label='U_Vop')
# plt.plot(range(len(p_j_vop_1)), p_j_vop_1,marker='*')
# plt.plot(range(len(p_j_vop_2)), p_j_vop_2, marker='<')


# 添加标题和轴标签
plt.xlabel('车辆数量', fontsize=16)
plt.ylabel('效益值', fontsize=16)
plt.xticks(fontsize=13.5)  # 修改x轴刻度字体大小
plt.yticks(fontsize=13.5)  # 修改y轴刻度字体大小
# 添加图例并设置字体大小
plt.legend(fontsize='16')
# 显示图形

plt.show()
