import matplotlib.pyplot as plt
import matplotlib

# 预设字体格式，并传给rc方法
import numpy as np
from numpy import array

font = {'family': 'SimHei', "size": 16}
matplotlib.rc('font', **font)  # 一次定义终身使用
# 四组数据
np.set_printoptions(precision=16)
U_user_v, U_S_t_v = [array([3.8688235294117717]), array([3.138961748633881, 2.308446969696975]), array([2.733711583924349 , 2.0918076285240508, 2.6523040935672495]), array([2.481999999999995 , 1.9171929824561431, 2.389629629629623 ,
       1.417142857142861 ]), array([2.2062222222222183, 1.7534117647058847, 2.1075068493150644,
       1.2992380952380986, 1.3834666666666695]), array([2.0224915824915777, 1.5973522458628844, 1.9176782752902106,
       1.2106318082788685, 1.3015111111111122, 1.2106318082788685]), array([1.9227936507936474, 1.4965227021040968, 1.8093052302888335,
       1.0854711246200621, 1.181532091097309 , 1.181532091097309 ,
       1.2818624338624336]), array([1.6758045977011478, 1.388577235772357 , 1.7929239766081853,
       1.0666287878787886, 1.0666287878787886, 1.0666287878787886,
       1.1689534883720931, 1.0666287878787886]), array([1.7096844993141271, 1.3118328584995231, 1.5876902356902343,
       0.9800352733686063, 1.0852393857271898, 0.9800352733686063,
       1.0852393857271898, 1.0852393857271898, 0.8797243755383295]), array([1.5337948717948708, 1.2579819819819806, 1.6619084967320255,
       0.913633333333333 , 1.0225299145299132, 0.913633333333333 ,
       1.0225299145299132, 1.0225299145299132, 0.8100487804878045,
       1.0225299145299132])],[23.77772273102427, 14.035237696833219, 9.707559307969605, 7.4820438185110225, 5.900410016547127, 4.385153319309734, 4.232156822212775, 3.645143738153209, 3.327375251456299, 2.9913544622053836]

U_user_v=[np.sum(arr) for arr in U_user_v]
# 绘制折线图
# plt.plot(range(len(U_user_v)), U_user_v, label='用户的平均效益值', marker='.')
# plt.plot(range(len(U_S_t_v[:,0])), U_S_t_v[:,0], label='云服务器的效益值', marker='o')
# plt.plot(range(len(U_S_t_v[:,1])), U_S_t_v[:,1], label='M1服务器的效益值', marker='s')
# plt.plot(range(len(U_S_t_v[:,2])), U_S_t_v[:,2], label='M2服务器的效益值', marker='^')
# plt.plot(range(len(U_vop_v)), U_vop_v, label='vop的效益值', marker='x')

# 绘制折线图
plt.plot(range(len(U_user_v)), U_user_v, label='用户的平均资源购买量', marker='.')
plt.plot(range(len(U_S_t_v)), U_S_t_v, label='ECSP服务器的平均资源购买量', marker='o')

# 添加图例
plt.legend()

# 添加标题和轴标签
plt.xlabel('ECSP数量', fontsize=16)
plt.ylabel('资源购买量', fontsize=16)
plt.xticks(fontsize=13.5)  # 修改x轴刻度字体大小
plt.yticks(fontsize=13.5)  # 修改y轴刻度字体大小
# 添加图例并设置字体大小
plt.legend(fontsize='16')
# 显示图形

plt.show()
