import matplotlib.pyplot as plt
import matplotlib

# 预设字体格式，并传给rc方法
import numpy as np
from numpy import array

font = {'family': 'SimHei', "size": 16}
matplotlib.rc('font', **font)  # 一次定义终身使用
# 四组数据
np.set_printoptions(precision=16)
# 用户平均资源购买情况 [4.597423187598625, 3.5678074074074067, 3.0976765188834134, 2.9069000760291077, 2.671810606060606, 2.528101587301587, 2.245374348569836, 2.1645899448649644, 2.113898474618654, 2.078565800180203]
# Cloud平均资源购买情况 [1.9992341482024836, 2.815600666991946, 3.0583202535547045, 4.1948885193836, 5.230141140358704, 5.472198579314881, 5.668288675215482, 5.722900697929706, 6.8343085948944164, 7.476594265965723]
# ECSPS平均资源购买情况 [1.4920704135791139, 2.315827716320445, 3.0160057942184064, 3.773678957854967, 4.3356131977736645, 4.922895641492554, 5.101074360136173, 5.620053917744894, 6.174495722051909, 6.745880417143311]

U_user_v, U_S_t_v = [4.597423187598625, 3.5678074074074067, 3.0976765188834134, 2.9069000760291077, 2.671810606060606, 2.528101587301587, 2.245374348569836, 2.1645899448649644, 2.113898474618654, 2.078565800180203],[1.4920704135791139, 2.315827716320445, 3.0160057942184064, 3.773678957854967, 4.3356131977736645, 4.922895641492554, 5.101074360136173, 5.620053917744894, 6.174495722051909, 6.745880417143311]

# U_user_v=[np.sum(arr) for arr in U_user_v]
# 绘制折线图
# plt.plot(range(len(U_user_v)), U_user_v, label='用户的平均效益值', marker='.')
# plt.plot(range(len(U_S_t_v[:,0])), U_S_t_v[:,0], label='云服务器的效益值', marker='o')
# plt.plot(range(len(U_S_t_v[:,1])), U_S_t_v[:,1], label='M1服务器的效益值', marker='s')
# plt.plot(range(len(U_S_t_v[:,2])), U_S_t_v[:,2], label='M2服务器的效益值', marker='^')
# plt.plot(range(len(U_vop_v)), U_vop_v, label='vop的效益值', marker='x')

# 绘制折线图
plt.plot(range(len(U_user_v)), U_user_v, label='用户的平均资源购买量', marker='.')
plt.plot(range(len(U_S_t_v)), U_S_t_v, label='ECSP服务器的平均资源购买量', marker='o')

# 添加图例
plt.legend()

# 添加标题和轴标签
plt.xlabel('用户数量', fontsize=16)
plt.ylabel('资源购买量', fontsize=16)
plt.xticks(fontsize=13.5)  # 修改x轴刻度字体大小
plt.yticks(fontsize=13.5)  # 修改y轴刻度字体大小
# 添加图例并设置字体大小
plt.legend(fontsize='16')
# 显示图形

plt.show()
