import matplotlib.pyplot as plt
import numpy as np

# 四组数据
np.set_printoptions(precision=16)

U_user_v, U_S_t_v = [2.7314583333333333, 2.7314583333333333, 2.7314583333333333, 2.722989038940125, 2.722989038940125,
                     2.722989038940125, 2.722989038940125, 2.9069000760291077, 2.9069000760291077, 2.9069000760291077,
                     2.9069000760291077, 2.9069000760291077, 2.9069000760291077], [0.0, 0.7601682555043867,
                                                                                   1.0728189126325773,
                                                                                   1.817534848506293, 1.989022352917603,
                                                                                   2.1537748554952945,
                                                                                   2.3867609053815784,
                                                                                   2.6897461060394994,
                                                                                   3.103526728238397, 3.309749200321826,
                                                                                   3.563074177090651, 3.714613555602166,
                                                                                   4.217106671182205]

ECSP_Resource = np.array([[0.0, 0.0, 0.0], [0.0, 1.5203365110087734, 0.0], [0.64613676164144, 2.1456378252651547, 0.0],
                          [0.36425171286577296, 3.635069697012586, 0.0], [1.0502017305110165, 3.978044705835206, 0.0],
                          [1.7092117408217824, 4.307549710990589, 0.0],
                          [2.097374651278315, 4.501631166218857, 0.2718906445442997],
                          [3.030451091315399, 4.3262693167014685, 1.0532228953775302],
                          [3.582158587580601, 4.602123064834066, 1.6049303916427284],
                          [3.8571218836918355, 4.739604712889685, 1.8798936877539667],
                          [4.1948885193836, 4.908488030735567, 2.2176603234457346],
                          [4.396941024065622, 5.009514283076578, 2.4197128281277536],
                          [5.0669318448390115, 5.344509693463271, 3.089703648901139]])
# U_user_v = [np.sum(arr) for arr in U_user_v]
# 绘制折线图
# plt.plot(range(len(U_user_v)), U_user_v, label='用户的平均效益值', marker='.')
# plt.plot(range(len(ECSP_Resource[:, 0])), ECSP_Resource[:, 0], label='$f^{1}_{vop}$', marker='o')
# plt.plot(range(len(ECSP_Resource[:, 1])), ECSP_Resource[:, 1], label='$f^{2}_{vop}$', marker='s')
# plt.plot(range(len(ECSP_Resource[:, 2])), ECSP_Resource[:, 2], label='$f^{3}_{vop}$', marker='^')
# plt.plot(range(len(U_vop_v)), U_vop_v, label='vop的效益值', marker='x')

# 绘制折线图
plt.plot(range(len(U_user_v)), U_user_v, label='$f_i$', marker='*', color='#d95319')
plt.plot(range(len(U_S_t_v)), U_S_t_v, label='$f^{j}_{vop}$', marker='o')

plt.xlim(0, 12)
# 添加标题和轴标签
plt.xlabel('Vechicle Number', fontweight='bold', fontsize=15.5)
plt.ylabel('Average Resource Purchase', fontweight='bold', fontsize=15.5)
plt.xticks(range(len(U_user_v)), range(0, 13), fontsize=13.5)  # 修改x轴刻度字体大小
plt.yticks(fontsize=13.5)  # 修改y轴刻度字体大小
# 添加图例并设置字体大小
plt.legend(fontsize='16')
# 显示图形

plt.show()
